{
    "navbar": {
        "home": "ទំព័រដើម",
        "about": "អំពី​ខ្ញុំ",
        "skills": "ជំនាញរបស់ខ្ញុំ",
        "projects": "គម្រោងការងារ",
        "contact": "ទំនាក់ទំនង"
    },
    "pages": {
        "home": {
            "leftSide": {},
            "rightSide": {
                "header": "ធ្វើការពី 1% ទៅ 100% នៅទីនេះ!",
                "sub-header": "🖐️សួស្តី ខ្ញុំ",
                "sub-header-2": "ហេង យូហុក.",
                "sub-header-3": "ខ្ញុំ​ជា",
                "components": {
                    "ContactInfo": "ទំនាក់ទំនងព័ត៌មាន",
                    "DownloadCV": "ទាញយកព័ត៌មាន"
                }
            }
        },
        "about": {
            "leftSide": {
                "header": "ខ្ញុំជានរណា",
                "content": [
                    "ខ្ញុំ \"ហេង យូហុក\"ធ្វើការពី 1% ទៅ 100% ជាអ្វីដែលខ្ញុំចូលចិត្ត។ នាំយកគំនិតរបស់ខ្ញុំទៅជីវិតជាមួយកូដ។ សព្វថ្ងៃខ្ញុំរស់នៅខេត្តបាត់ដំបង ប្រទេសកម្ពុជា។ ខ្ញុំកំពុងសិក្សានៅសាកលវិទ្យាល័យ NUBB ។ ការងារដូចជា បង្កើតគេហទំព័រ កម្មវិធីគេហទំព័រ កម្មវិធីទូរស័ព្ទ (Android/IOS) និងអ្នកស្រាវជ្រាវ និងណែនាំបច្ចេកវិទ្យាថ្មីៗសម្រាប់ក្រុម។ ខ្ញុំជាអ្នកអភិវឌ្ឍន៍ Front-End ។ ខ្ញុំមានចំណង់ចំណូលចិត្តយ៉ាងខ្លាំងចំពោះផលប៉ះពាល់ UI ចលនា និងការបង្កើតវិចារណញាណ ថាមវន្ត បទពិសោធន៍អ្នកប្រើប្រាស់។ អ្នករៀបចំបានល្អ អ្នកដោះស្រាយបញ្ហា បុគ្គលិកឯករាជ្យដោយយកចិត្តទុកដាក់ខ្ពស់ចំពោះព័ត៌មានលម្អិត។ អ្នកគាំទ្រក្បាច់ប្រដាល់ចម្រុះ សកម្មភាពក្រៅផ្ទះ។ ចាប់អារម្មណ៍លើវិសាលគមផ្នែកខាងមុខទាំងមូល និងធ្វើការលើគម្រោងដែលមានមហិច្ឆតាជាមួយមនុស្សវិជ្ជមាន។"
                ],
                "components": {
                    "projectBtn": "មើលគម្រោងការងាររបស់ខ្ញុំ"
                }
            },
            "skills": {
                "header": "ជំនាញ និងបទពិសោធន៍",
                "header-2": "ជំនាញ និងឧបករណ៍ផ្សេងៗ",
                "header-3": "ជំនាញ​របស់ខ្ញុំ",
                "content": {
                    "talk": "ចាប់តាំងពីចាប់ផ្តើមដំណើររបស់ខ្ញុំក្នុងនាមជាអ្នកអភិវឌ្ឍន៍ឯករាជ្យជិត 3 ឆ្នាំមុន ខ្ញុំបានធ្វើការងារពីចម្ងាយសម្រាប់ទីភ្នាក់ងារ ប្រឹក្សាយោបល់សម្រាប់ការចាប់ផ្តើមអាជីវកម្ម និងសហការជាមួយមនុស្សដែលមានទេពកោសល្យដើម្បីបង្កើតផលិតផលគេហទំព័រសម្រាប់ទាំងអាជីវកម្ម និងអ្នកប្រើប្រាស់។ ខ្ញុំបង្កើតគេហទំព័រឆ្លើយតបដោយជោគជ័យ ដែលមានល្បឿនលឿន ងាយស្រួលប្រើ និងបង្កើតដោយការអនុវត្តល្អបំផុត។ ផ្នែកសំខាន់នៃជំនាញរបស់ខ្ញុំគឺការអភិវឌ្ឍន៍ផ្នែកខាងមុខ HTML, CSS, JS, ការបង្កើតកម្មវិធីបណ្ដាញតូច និងមធ្យម, កម្មវិធីជំនួយផ្ទាល់ខ្លួន, លក្ខណៈពិសេស, ចលនា និងការរៀបចំកូដអន្តរកម្ម។"
                }
            }
        },
        "project": {
            "topSide": {
                "header": "គម្រោងការងាររបស់ខ្ញុំ",
                "content": "គំរូការងារពេញមួយឆ្នាំ Web Developer, Mobile App, Hosting, លំហូរការងារ និងច្រើនទៀត...",
                "components": {
                    "contactBtn": "ទំនាក់ទំនង",
                    "websiteBtn": "វេបសាប",
                    "MoblieBtn": "ទូរស័ព្ទ",
                    "WorkflowBtn": "លំហូរការងារ"
                }
            }
        },
        "article": {
            "topSide": {
                "header": "Sharing knowledge is a part of my life.",
                "content": [
                    "I've made a ton of mistakes, learned a lot of lessons, and — in a few mistake cases — make me figured out who i am.",
                    "here I'll share some knowledge and news related to technology."
                ]
            }
        },
        "contact": {
            "leftSide": {
                "header": "តើមានសំណួរ ឬចង់ធ្វើការជាមួយគ្នា?",
                "content": "ផ្ញើសារមកកាន់ខ្ញុំតាមបណ្តាញសង្គមខាងក្រោម៖",
                "components": {}
            },
            "rightSide": {}
        }
    },
    "components": {
        "loading": "Collecting Data",
        "noData": {
            "title": "No Data Available",
            "content": "there is no data to show you right now."
        }
    }
}